Vanbatai123/AVR/ATmega_16/LCD_TFT_2/CODE/LCD_TFT_2/LCD_TFT_2/UTFT.cpp
/*
  UTFT.cpp - Arduino/chipKit library support for Color TFT LCD Boards
  Copyright (C)2010-2012 Henning Karlsen. All right reserved
  
  This library is the continuation of my ITDB02_Graph, ITDB02_Graph16
  and RGB_GLCD libraries for Arduino and chipKit. As the number of 
  supported display modules and controllers started to increase I felt 
  it was time to make a single, universal library as it will be much 
  easier to maintain in the future.

  Basic functionality of this library was origianlly based on the 
  demo-code provided by ITead studio (for the ITDB02 modules) and 
  NKC Electronics (for the RGB GLCD module/shield).

  This library supports a number of 8bit, 16bit and serial graphic 
  displays, and will work with both Arduino and chipKit boards. For a 
  full list of tested display modules and controllers, see the 
  document UTFT_Supported_display_modules_&_controllers.pdf.

  When using 8bit and 16bit display modules there are some 
  requirements you must adhere to. These requirements can be found 
  in the document UTFT_Requirements.pdf.
  There are no special requirements when using serial displays.

  You can always find the latest version of the library at 
  http://electronics.henningkarlsen.com/

  If you make any modifications or improvements to the code, I would 
  appreciate that you share the code with me so that I might include 
  it in the next release. I can be contacted through 
  http://electronics.henningkarlsen.com/contact.php.

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/

#include "UTFT.h"
#include <pins_arduino.h>

// Include hardware-specific functions for the correct MCU
#if defined(__AVR__)
	#include <avr/pgmspace.h>
	#if defined(__AVR_ATmega1280__) || defined(__AVR_ATmega2560__)
		#include "HW_ATmega1280.h" 
	#elif defined(__AVR_ATmega328P__)
		#include "HW_ATMega328P.h"
	#elif defined(__AVR_ATmega32U4__)
		#include "HW_ATMega32U4.h"
	#elif defined(__AVR_ATmega168__)
		#error "ATmega168 MCUs are not supported because they have too little flash memory!"
	#else
		#error "Unsupported AVR MCU!"
	#endif
#elif defined(__PIC32MX__)
  #if defined(__32MX320F128H__)
    #pragma message("Compiling for chipKIT UNO32 (__32MX320F128H__)")
	#include "HW_PIC32MX320F128H.h"
  #elif defined(__32MX340F512H__)
    #error "chipKIT uC32 (__32MX340F512H__) is not supported."
  #elif defined(__32MX795F512L__)
    #pragma message("Compiling for chipKIT MAX32 (__32MX795F512L__)")
	#include "HW_PIC32MX795F512L.h"
  #else
    #error "Unsupported PIC32 MCU!"
  #endif  
#elif defined(__arm__)
	#if defined(__SAM3X8E__)
		#pragma message("Compiling for Arduino Due (AT91SAM3X8E)...")
		#include "HW_SAM3X8E.h"
	#else
		#error "Unsupported ARM MCU!"
	#endif
#endif
#include "memorysaver.h"
void LCD_Writ_Bus(char VH,char VL, int mode)
{   
	switch (mode)
	{
	case 1:
		if (display_serial_mode==SERIAL_4PIN)
		{
		if (VH==1)
			sbi(PORT_SDA, BIT_SDA);
		else
			cbi(PORT_SDA, BIT_SDA);
		pulse_low(PORT_CSL, BIT_SCL);
		}
		else
		{
		if (VH==1)
			sbi(PORT_RS, BIT_RS);
		else
			cbi(PORT_RS, BIT_RS);
		}

		if (VL & 0x80)
			sbi(PORT_SDA, BIT_SDA);
		else
			cbi(PORT_SDA, BIT_SDA);
		pulse_low(PORT_CSL, BIT_SCL);
		if (VL & 0x40)
			sbi(PORT_SDA, BIT_SDA);
		else
			cbi(PORT_SDA, BIT_SDA);
		pulse_low(PORT_CSL, BIT_SCL);
		if (VL & 0x20)
			sbi(PORT_SDA, BIT_SDA);
		else
			cbi(PORT_SDA, BIT_SDA);
		pulse_low(PORT_CSL, BIT_SCL);
		if (VL & 0x10)
			sbi(PORT_SDA, BIT_SDA);
		else
			cbi(PORT_SDA, BIT_SDA);
		pulse_low(PORT_CSL, BIT_SCL);
		if (VL & 0x08)
			sbi(PORT_SDA, BIT_SDA);
		else
			cbi(PORT_SDA, BIT_SDA);
		pulse_low(PORT_CSL, BIT_SCL);
		if (VL & 0x04)
			sbi(PORT_SDA, BIT_SDA);
		else
			cbi(PORT_SDA, BIT_SDA);
		pulse_low(PORT_CSL, BIT_SCL);
		if (VL & 0x02)
			sbi(PORT_SDA, BIT_SDA);
		else
			cbi(PORT_SDA, BIT_SDA);
		pulse_low(PORT_CSL, BIT_SCL);
		if (VL & 0x01)
			sbi(PORT_SDA, BIT_SDA);
		else
			cbi(PORT_SDA, BIT_SDA);
		pulse_low(PORT_CSL, BIT_SCL);
		break;
	case 8:
#if defined(__AVR_ATmega1280__) || defined(__AVR_ATmega2560__)
		PORTA = VH;
		pulse_low(PORT_RW, BIT_RW);
		PORTA = VL;
		pulse_low(PORT_RW, BIT_RW);
#else
		PORTD = VH;
		pulse_low(PORT_RW, BIT_RW);
		PORTD = VL;
		pulse_low(PORT_RW, BIT_RW);
#endif
		break;
	case 16:
#if defined(__AVR_ATmega1280__) || defined(__AVR_ATmega2560__)
		PORTA = VH;
		PORTC = VL;
#else
		PORTD = VH;
		cport(PORTC, 0xFC);
		sport(PORTC, (VL>>6) & 0x03);
		PORTB =  VL & 0x3F;
#endif
		pulse_low(PORT_RW, BIT_RW);
		break;
	case LATCHED_16:
#if defined(__AVR_ATmega1280__) || defined(__AVR_ATmega2560__)
		PORTG &= ~0x20;	
		PORTG |= (VH & 0x10)<<1;	
		PORTH &= ~0x18;	
		PORTH |= (VH & 0xC0)>>3;	
		PORTE &= ~0x3B;	
		PORTE |= (VH & 0x03) + ((VH & 0x0C)<<2) + ((VH & 0x20)>>2);
		cbi(P_ALE, B_ALE);
		pulse_high(P_ALE, B_ALE);
		cbi(PORT_CS, BIT_CS);
		PORTG &= ~0x20;	
		PORTG |= (VL & 0x10)<<1;	
		PORTH &= ~0x18;	
		PORTH |= (VL & 0xC0)>>3;	
		PORTE &= ~0x3B;	
		PORTE |= (VL & 0x03) + ((VL & 0x0C)<<2) + ((VL & 0x20)>>2);
#else
		PORTD = VH;
		cbi(P_ALE, B_ALE);
		pulse_high(P_ALE, B_ALE);
		cbi(PORT_CS, BIT_CS);
		PORTD =  VL;
#endif
		pulse_low(PORT_RW, BIT_RW);
		sbi(PORT_CS, BIT_CS);
		break;
	}
}

