Vanbatai123/AVR/ATmega_16/LCD_TFT_2/CODE/LCD_TFT_2/LCD_TFT_2/UTFT.cpp
void _set_direction_registers(byte mode)
{
#if defined(__AVR_ATmega1280__) || defined(__AVR_ATmega2560__)
	if (mode!=LATCHED_16)
	{
		DDRA = 0xFF;
		if (mode==16)
			DDRC = 0xFF;
	}
	else
	{
		DDRH = 0x18;
		DDRG = 0x20;
		DDRE = 0x3B;
	}
#else
	DDRD = 0xFF;
	if (mode==16)
	{
		DDRB |= 0x3F;
		DDRC |= 0x03;
	}
#endif

}

void _fast_fill_16(int ch, int cl, long pix)
{
	long blocks;

#if defined(__AVR_ATmega1280__) || defined(__AVR_ATmega2560__)
	PORTA = ch;
	PORTC = cl;
#else
	PORTD = ch;
	cport(PORTC, 0xFC);
	sport(PORTC, (cl>>6) & 0x03);
	PORTB =  cl & 0x3F;
#endif

	blocks = pix/16;
	for (int i=0; i<blocks; i++)
	{
		pulse_low(PORT_RW, BIT_RW);
		pulse_low(PORT_RW, BIT_RW);
		pulse_low(PORT_RW, BIT_RW);
		pulse_low(PORT_RW, BIT_RW);
		pulse_low(PORT_RW, BIT_RW);
		pulse_low(PORT_RW, BIT_RW);
		pulse_low(PORT_RW, BIT_RW);
		pulse_low(PORT_RW, BIT_RW);
		pulse_low(PORT_RW, BIT_RW);
		pulse_low(PORT_RW, BIT_RW);
		pulse_low(PORT_RW, BIT_RW);
		pulse_low(PORT_RW, BIT_RW);
		pulse_low(PORT_RW, BIT_RW);
		pulse_low(PORT_RW, BIT_RW);
		pulse_low(PORT_RW, BIT_RW);
		pulse_low(PORT_RW, BIT_RW);
	}
	if ((pix % 16) != 0)
		for (int i=0; i<(pix % 16); i++)
		{
			pulse_low(PORT_RW, BIT_RW);
		}
}

void _fast_fill_8(int ch, long pix)
{
	long blocks;

#if defined(__AVR_ATmega1280__) || defined(__AVR_ATmega2560__)
	PORTA = ch;
#else
	PORTD = ch;
#endif

	blocks = pix/16;
	for (int i=0; i<blocks; i++)
	{
		pulse_low(PORT_RW, BIT_RW);pulse_low(PORT_RW, BIT_RW);
		pulse_low(PORT_RW, BIT_RW);pulse_low(PORT_RW, BIT_RW);
		pulse_low(PORT_RW, BIT_RW);pulse_low(PORT_RW, BIT_RW);
		pulse_low(PORT_RW, BIT_RW);pulse_low(PORT_RW, BIT_RW);
		pulse_low(PORT_RW, BIT_RW);pulse_low(PORT_RW, BIT_RW);
		pulse_low(PORT_RW, BIT_RW);pulse_low(PORT_RW, BIT_RW);
		pulse_low(PORT_RW, BIT_RW);pulse_low(PORT_RW, BIT_RW);
		pulse_low(PORT_RW, BIT_RW);pulse_low(PORT_RW, BIT_RW);
		pulse_low(PORT_RW, BIT_RW);pulse_low(PORT_RW, BIT_RW);
		pulse_low(PORT_RW, BIT_RW);pulse_low(PORT_RW, BIT_RW);
		pulse_low(PORT_RW, BIT_RW);pulse_low(PORT_RW, BIT_RW);
		pulse_low(PORT_RW, BIT_RW);pulse_low(PORT_RW, BIT_RW);
		pulse_low(PORT_RW, BIT_RW);pulse_low(PORT_RW, BIT_RW);
		pulse_low(PORT_RW, BIT_RW);pulse_low(PORT_RW, BIT_RW);
		pulse_low(PORT_RW, BIT_RW);pulse_low(PORT_RW, BIT_RW);
		pulse_low(PORT_RW, BIT_RW);pulse_low(PORT_RW, BIT_RW);
	}
	if ((pix % 16) != 0)
		for (int i=0; i<(pix % 16); i++)
		{
			pulse_low(PORT_RW, BIT_RW);pulse_low(PORT_RW, BIT_RW);
		}
}
UTFT(byte model, int RS, int WR,int CS, int RST, int SER)
{ 
	switch (model)
	{
		case HX8347A:
			disp_x_size=239;
			disp_y_size=319;
			display_transfer_mode=16;
			break;
		case ILI9327:
			disp_x_size=239;
			disp_y_size=399;
			display_transfer_mode=16;
			break;
		case SSD1289:
			disp_x_size=239;
			disp_y_size=319;
			display_transfer_mode=16;
			break;
		case ILI9325C:
			disp_x_size=239;
			disp_y_size=319;
			display_transfer_mode=8;
			break;
		case ILI9325D_8:
			disp_x_size=239;
			disp_y_size=319;
			display_transfer_mode=8;
			break;
		case ILI9325D_16:
			disp_x_size=239;
			disp_y_size=319;
			display_transfer_mode=16;
			break;
		case HX8340B_8:
			disp_x_size=175;
			disp_y_size=219;
			display_transfer_mode=8;
			break;
		case HX8340B_S:
			disp_x_size=175;
			disp_y_size=219;
			display_transfer_mode=1;
			display_serial_mode=SERIAL_4PIN;
			break;
		case HX8352A:
			disp_x_size=239;
			disp_y_size=399;
			display_transfer_mode=16;
			break;
		case ST7735:
			disp_x_size=127;
			disp_y_size=159;
			display_transfer_mode=1;
			display_serial_mode=SERIAL_5PIN;
			break;
		case PCF8833:
			disp_x_size=127;
			disp_y_size=127;
			display_transfer_mode=1;
			display_serial_mode=SERIAL_5PIN;
			break;
		case S1D19122:
			disp_x_size=239;
			disp_y_size=319;
			display_transfer_mode=16;
			break;
		case SSD1963_480:
			disp_x_size=271;
			disp_y_size=479;
			display_transfer_mode=16;
			break;
		case SSD1963_800:
			disp_x_size=479;
			disp_y_size=799;
			display_transfer_mode=16;
			break;
		case S6D1121_8:
			disp_x_size=239;
			disp_y_size=319;
			display_transfer_mode=8;
			break;
		case S6D1121_16:
			disp_x_size=239;
			disp_y_size=319;
			display_transfer_mode=16;
			break;
		case SSD1289LATCHED:
			disp_x_size=239;
			disp_y_size=319;
			display_transfer_mode=LATCHED_16;
			break;
		case ILI9320_8:
			disp_x_size=239;
			disp_y_size=319;
			display_transfer_mode=8;
			break;
		case ILI9320_16:
			disp_x_size=239;
			disp_y_size=319;
			display_transfer_mode=16;
			break;
	}
	display_model=model;

	if (display_transfer_mode!=1)
	{
		_set_direction_registers(display_transfer_mode);
		PORT_RS	= portOutputRegister(digitalPinToPort(RS));
		BIT_RS	= digitalPinToBitMask(RS);
		PORT_RW	= portOutputRegister(digitalPinToPort(WR));
		BIT_RW	= digitalPinToBitMask(WR);
		PORT_CS	= portOutputRegister(digitalPinToPort(CS));
		BIT_CS	= digitalPinToBitMask(CS);
		PORT_RST	= portOutputRegister(digitalPinToPort(RST));
		BIT_RST	= digitalPinToBitMask(RST);
		if (display_transfer_mode==LATCHED_16)
		{
			P_ALE	= portOutputRegister(digitalPinToPort(SER));
			B_ALE	= digitalPinToBitMask(SER);
			pinMode(SER,OUTPUT);
			cbi(P_ALE, B_ALE);
			pinMode(8,OUTPUT);
			digitalWrite(8, LOW);
		}
		pinMode(RS,OUTPUT);
		pinMode(WR,OUTPUT);
		pinMode(CS,OUTPUT);
		pinMode(RST,OUTPUT);
	}
	else
	{
		PORT_SDA	= portOutputRegister(digitalPinToPort(RS));
		BIT_SDA	= digitalPinToBitMask(RS);
		PORT_CSL	= portOutputRegister(digitalPinToPort(WR));
		BIT_SCL	= digitalPinToBitMask(WR);
		PORT_CS	= portOutputRegister(digitalPinToPort(CS));
		BIT_CS	= digitalPinToBitMask(CS);
		PORT_RST	= portOutputRegister(digitalPinToPort(RST));
		BIT_RST	= digitalPinToBitMask(RST);
		if (display_serial_mode!=SERIAL_4PIN)
		{
			PORT_RS	= portOutputRegister(digitalPinToPort(SER));
			BIT_RS	= digitalPinToBitMask(SER);
			pinMode(SER,OUTPUT);
		}
		pinMode(RS,OUTPUT);
		pinMode(WR,OUTPUT);
		pinMode(CS,OUTPUT);
		pinMode(RST,OUTPUT);
	}
}

void LCD_Write_COM(char VL)  
{   
	if (display_transfer_mode!=1)
	{
		cbi(PORT_RS, BIT_RS);
		LCD_Writ_Bus(0x00,VL,display_transfer_mode);
	}
	else
		LCD_Writ_Bus(0x00,VL,display_transfer_mode);
}

void LCD_Write_DATA(char VH,char VL)
{
	if (display_transfer_mode!=1)
	{
		sbi(PORT_RS, BIT_RS);
		LCD_Writ_Bus(VH,VL,display_transfer_mode);
	}
	else
	{
		LCD_Writ_Bus(0x01,VH,display_transfer_mode);
		LCD_Writ_Bus(0x01,VL,display_transfer_mode);
	}
}

void LCD_Write_DATA(char VL)
{
	if (display_transfer_mode!=1)
	{
		sbi(PORT_RS, BIT_RS);
		LCD_Writ_Bus(0x00,VL,display_transfer_mode);
	}
	else
		LCD_Writ_Bus(0x01,VL,display_transfer_mode);
}

